tangb765/FredFoc/gimbal/stm32f40x/MCApplication/src/MCTasks.c
#if (INRUSH_CURRLIMIT_ENABLING == ENABLE)
CICL oICL_M1;
CDOUT oICLDOUT_M1;
#endif

#if (INRUSH_CURRLIMIT_ENABLING2 == ENABLE)
CICL oICL_M2;
CDOUT oICLDOUT_M2;
#endif

struct rt_semaphore hMFTask1_sem;
struct rt_semaphore hMFTask2_sem;
static volatile uint16_t hMFTaskCounterM1_t = 0;
static volatile uint16_t hMFTaskCounterM2_t = 0;

static volatile uint16_t hMFTaskCounterM1 = 0;
static volatile uint16_t hBootCapDelayCounterM1 = 0;
static volatile uint16_t hStopPermanencyCounterM1 = 0;
#ifdef DUALDRIVE
static volatile uint16_t hMFTaskCounterM2 = 0;
static volatile uint16_t hBootCapDelayCounterM2 = 0;
static volatile uint16_t hStopPermanencyCounterM2 = 0;
#endif

static uint8_t UDC_Channel = 0u;
static uint16_t UDC_ConvertedValue = 0u;
static volatile UDRC_State_t UDC_State = UDRC_STATE_IDLE;

/* Private functions ---------------------------------------------------------*/
static void TSK_MediumFrequencyTaskM1(void);
static void FOC_Clear(uint8_t bMotor);
static void FOC_InitAdditionalMethods(uint8_t bMotor);
static void FOC_CalcCurrRef(uint8_t bMotor);
static uint16_t FOC_CurrController(uint8_t bMotor);

void TSK_SetChargeBootCapDelayM1(uint16_t hTickCount);
bool TSK_ChargeBootCapDelayHasElapsedM1(void);
static void TSK_SetStopPermanencyTimeM1(uint16_t hTickCount);
static bool TSK_StopPermanencyTimeHasElapsedM1(void);

void TSK_SafetyTask_PWMOFF(uint8_t motor);
void TSK_SafetyTask_RBRK(uint8_t motor);
void TSK_SafetyTask_LSON(uint8_t motor);

#ifdef DUALDRIVE
static void TSK_MediumFrequencyTaskM2(void);

void TSK_SetChargeBootCapDelayM2(uint16_t hTickCount);
bool TSK_ChargeBootCapDelayHasElapsedM2(void);
static void TSK_SetStopPermanencyTimeM2(uint16_t SysTickCount);
static bool TSK_StopPermanencyTimeHasElapsedM2(void);

#define FOC_ARRAY_LENGHT 2
static void *FOC_array[FOC_ARRAY_LENGHT]={MC_NULL,MC_NULL};
static uint8_t FOC_array_head = 0; // Next obj to be executed
static uint8_t FOC_array_tail = 0; // Last arrived
#endif

/****************************** USE ONLY FOR SDK 4.0 EXAMPLES *************/  
#if defined(EXAMPLE_SPEEDMONITOR)
   void ARR_TIM5_update(CSPD xCSPD);
#endif

void Init_Config_PID(void)
{
	rt_memcpy((void *)&configs.oPIDPos,&PIPosParamsM1,sizeof(PIParams_t));
	rt_memcpy((void *)&configs.oPIDDPos,&PIDPosParamsM1,sizeof(PIDParams_t));
	rt_memcpy((void *)&configs.oPIDSpeed,&PISpeedParamsM1,sizeof(PIParams_t));
	rt_memcpy((void *)&configs.oPIDIq,&PIIqParamsM1,sizeof(PIParams_t));
	rt_memcpy((void *)&configs.oPIDId,&PIIdParamsM1,sizeof(PIParams_t));
}

void Init_PID(void)
{
	rt_memcpy((void *)&PIPosParamsM1,&configs.oPIDPos,sizeof(PIParams_t));
	rt_memcpy((void *)&PIDPosParamsM1,&configs.oPIDDPos,sizeof(PIDParams_t));
	rt_memcpy((void *)&PISpeedParamsM1,&configs.oPIDSpeed,sizeof(PIParams_t));
	rt_memcpy((void *)&PIIqParamsM1,&configs.oPIDIq,sizeof(PIParams_t));
	rt_memcpy((void *)&PIIdParamsM1,&configs.oPIDId,sizeof(PIParams_t));
}

/**************************************************************************/   

/**
  * @brief  It initializes the whole MC core according to user defined 
  *         parameters.
  * @param  oMCIList pointer to the vector of MCInterface objects that will be
  *         created and initialized. The vector must have length equal to the 
  *         number of motor drives.
  * @param  oMCTList pointer to the vector of MCTuning objects that will be
  *         created and initialized. The vector must have length equal to the 
  *         number of motor drives.
  * @retval None
  */
void MCboot(CMCI oMCIList[NBR_OF_MOTORS],CMCT oMCTList[NBR_OF_MOTORS])
{
#if defined(FLUX_WEAKENING)
  FWInit_t FWInitStructureM1; /* only if M1 has FW */
#endif
#if defined(FEED_FORWARD_CURRENT_REGULATION)
  FFInit_t FFInitStructureM1; /* only if M1 has FF */
#endif
#if defined(HFINJECTION) 
  HFI_FP_Init_t HFI_FP_InitStructureM1; /* only if M1 has HFI */
#endif
  
  PQD_MPMInitStruct_t PQD_MPMInitStruct;
  
#ifdef MC_TUNING_INTERFACE
  MCTuningInitStruct_t MCTInitStruct;
#endif

#ifdef DUALDRIVE
#if defined(FLUX_WEAKENING2)
  FWInit_t FWInitStructureM2; /* only if M2 has FW */
#endif
#if defined(FEED_FORWARD_CURRENT_REGULATION2)
  FFInit_t FFInitStructureM2; /* only if M2 has FF */
#endif
#if defined(HFINJECTION2) 
  HFI_FP_Init_t HFI_FP_InitStructureM2; /* only if M2 has HFI */
#endif
#endif
  
	rt_sem_init(&hMFTask1_sem, "MFTask1", 0, 0);
	rt_sem_init(&hMFTask2_sem, "MFTask2", 0, 0);
	
  oCLM[M1] = CLM_NewObject(&CircleLimitationParamsM1);

#if defined(FLUX_WEAKENING)
  oFW[M1] = FW_NewObject(&FWParamsM1); /* only if M1 has FW */
#endif
  
#if defined(FEED_FORWARD_CURRENT_REGULATION)
  oFF[M1] = FF_NewObject(&FFParamsM1); /* only if M1 has FF */
#endif
  
#if defined(IPMSM_MTPA)
  oMTPA[M1] = MTPA_NewObject(&MTPAParamsM1); /* only if M1 has MTPA */
#endif
  
#if defined(OPEN_LOOP)
  oOL[M1] = OL_NewObject(&OpenLoop_ParamsM1); /* only if M1 has OPEN LOOP */
#endif
  
#if defined(HFINJECTION) 
  oHFI[M1] = HFI_FP_NewObject(&HiFreqInj_FPU_ParamsM1); /* only if M1 has HFI */
#endif

  /* PWMC derived class object instantiation M1 */
#if ((defined STM32PERFORMANCE)&&(defined THREE_SHUNT)&&(defined SINGLEDRIVE))
  oCurrSensor[M1] = (CPWMC)R3LM1_NewObject(&PWMnCurrFdbkParamsM1, &R3_LM1ParamsSD);
#elif ((defined STM32PERFORMANCE)&&(defined SINGLE_SHUNT)&&(defined SINGLEDRIVE))
  oCurrSensor[M1] = (CPWMC)R1LM1_NewObject(&PWMnCurrFdbkParamsM1, &R1_LM1ParamsSD);
#elif ((defined STM32PERFORMANCE)&&(defined ICS_SENSORS)&&(defined SINGLEDRIVE))
  oCurrSensor[M1] = (CPWMC)ILM1_NewObject(&PWMnCurrFdbkParamsM1, &ICS_LM1ParamsSD);  
#elif ((defined STM32VALUE)&&(defined SINGLE_SHUNT)&&(defined SINGLEDRIVE))  
  oCurrSensor[M1] = (CPWMC)R1VL1_NewObject(&PWMnCurrFdbkParamsM1, &R1_VL1ParamsSD);
#elif ((defined STM32HD)&&(defined SINGLE_SHUNT))
  oCurrSensor[M1] = (CPWMC)R1HD2_NewObject(&PWMnCurrFdbkParamsM1, &R1_DDParamsM1);
#elif ((defined STM32HD)&&(defined THREE_SHUNT))
  oCurrSensor[M1] = (CPWMC)R3HD2_NewObject(&PWMnCurrFdbkParamsM1, &R3_DDParamsM1);
#elif ((defined STM32HD)&&(defined ICS_SENSORS))
  oCurrSensor[M1] = (CPWMC)IHD2_NewObject(&PWMnCurrFdbkParamsM1, &ICS_DDParamsM1);
#elif ((defined STM32F2XX)&&(defined THREE_SHUNT))
  oCurrSensor[M1] = (CPWMC)R3F2XX_NewObject(&PWMnCurrFdbkParamsM1, &R3_DDParamsM1);
#elif ((defined STM32F2XX)&&(defined SINGLE_SHUNT))
  oCurrSensor[M1] = (CPWMC)R1F2XX_NewObject(&PWMnCurrFdbkParamsM1, &R1_DDParamsM1);
#elif ((defined STM32F2XX)&&(defined ICS_SENSORS))
  oCurrSensor[M1] = (CPWMC)IF2XX_NewObject(&PWMnCurrFdbkParamsM1, &ICS_DDParamsM1);
#elif ((defined STM32F40XX)&&(defined THREE_SHUNT))
  oCurrSensor[M1] = (CPWMC)R3F4XX_NewObject(&PWMnCurrFdbkParamsM1, &R3_DDParamsM1);
#elif ((defined STM32F40XX)&&(defined SINGLE_SHUNT))
  oCurrSensor[M1] = (CPWMC)R1F4XX_NewObject(&PWMnCurrFdbkParamsM1, &R1_DDParamsM1);
#elif ((defined STM32F40XX)&&(defined ICS_SENSORS))
  oCurrSensor[M1] = (CPWMC)IF4XX_NewObject(&PWMnCurrFdbkParamsM1, &ICS_DDParamsM1);
#elif ((defined STM32F0XX)&&(defined SINGLE_SHUNT))
  oCurrSensor[M1] = (CPWMC)R1F0XX_NewObject(&PWMnCurrFdbkParamsM1, &R1_SDParams);
#elif ((defined STM32F30X)&&(defined THREE_SHUNT_INDEPENDENT_RESOURCES))
  oCurrSensor[M1] = (CPWMC)R3_4_F3XX_NewObject(&PWMnCurrFdbkParamsM1, &R3_4_F30XParamsM1);
#elif ((defined STM32F30X)&&(defined THREE_SHUNT_SHARED_RESOURCES))
  oCurrSensor[M1] = (CPWMC)R3_2_F3XX_NewObject(&PWMnCurrFdbkParamsM1, &R3_2_F30XParamsM1);
#elif ((defined STM32F30X)&&(defined SINGLE_SHUNT))
  oCurrSensor[M1] = (CPWMC)R1F3XX_NewObject(&PWMnCurrFdbkParamsM1,&R1_F30XParamsM1);
#elif ((defined STM32F30X)&&(defined ICS_SENSORS))
  oCurrSensor[M1] = (CPWMC)IF3XX_NewObject(&PWMnCurrFdbkParamsM1, &ICS_DDParamsM1);
#else  
#error "Invalid boot: configuration not valid or to be assigned"
#endif

