tangb765/FredFoc/gimbal/stm32f40x/MCApplication/src/MCTasks.c
  PWMC_Init(oCurrSensor[M1]);  

#if ((HW_OV_CURRENT_PROT_BYPASS == ENABLE) && (ON_OVER_VOLTAGE == TURN_ON_LOW_SIDES))
  oOCPDisabling[M1] = DOUT_NewObject(&DOUT_OCPDisablingParamsM1); 
  DOUT_Init(oOCPDisabling[M1]);
#endif   
  
#ifdef DUALDRIVE
  
  oCLM[M2] = CLM_NewObject(&CircleLimitationParamsM2);

#if defined(FLUX_WEAKENING2)
  oFW[M2] = FW_NewObject(&FWParamsM2); /* only if M2 has FW */
#endif
  
#if defined(FEED_FORWARD_CURRENT_REGULATION2)
  oFF[M2] = FF_NewObject(&FFParamsM2); /* only if M2 has FF */
#endif
  
#if defined(IPMSM_MTPA2)
  oMTPA[M2] = MTPA_NewObject(&MTPAParamsM2); /* only if M2 has MTPA */
#endif
  
#if defined(OPEN_LOOP2)
  oOL[M2] = OL_NewObject(&OpenLoop_ParamsM2); /* only if M2 has OPEN LOOP */
#endif
  
#if defined(HFINJECTION2) 
  oHFI[M2] = HFI_FP_NewObject(&HiFreqInj_FPU_ParamsM2); /* only if M2 has HFI */
#endif

  /* PWMC derived class object instantiation M2 */
#if ((defined STM32HD)&&(defined SINGLE_SHUNT2))
  oCurrSensor[M2] = (CPWMC)R1HD2_NewObject(&PWMnCurrFdbkParamsM2, &R1_DDParamsM2);
#elif ((defined STM32HD)&&(defined THREE_SHUNT2))
  oCurrSensor[M2] = (CPWMC)R3HD2_NewObject(&PWMnCurrFdbkParamsM2, &R3_DDParamsM2);
#elif ((defined STM32HD)&&(defined ICS_SENSORS2))
  oCurrSensor[M2] = (CPWMC)IHD2_NewObject(&PWMnCurrFdbkParamsM2, &ICS_DDParamsM2);
#elif ((defined STM32F2XX)&&(defined SINGLE_SHUNT2))
  oCurrSensor[M2] = (CPWMC)R1F2XX_NewObject(&PWMnCurrFdbkParamsM2, &R1_DDParamsM2);
#elif ((defined STM32F2XX)&&(defined THREE_SHUNT2))
  oCurrSensor[M2] = (CPWMC)R3F2XX_NewObject(&PWMnCurrFdbkParamsM2, &R3_DDParamsM2);
#elif ((defined STM32F2XX)&&(defined ICS_SENSORS2))
  oCurrSensor[M2] = (CPWMC)IF2XX_NewObject(&PWMnCurrFdbkParamsM2, &ICS_DDParamsM2);
#elif ((defined STM32F40XX)&&(defined SINGLE_SHUNT2))
  oCurrSensor[M2] = (CPWMC)R1F4XX_NewObject(&PWMnCurrFdbkParamsM2, &R1_DDParamsM2);
#elif ((defined STM32F40XX)&&(defined THREE_SHUNT2))
  oCurrSensor[M2] = (CPWMC)R3F4XX_NewObject(&PWMnCurrFdbkParamsM2, &R3_DDParamsM2);
#elif ((defined STM32F40XX)&&(defined ICS_SENSORS2))
  oCurrSensor[M2] = (CPWMC)IF4XX_NewObject(&PWMnCurrFdbkParamsM2, &ICS_DDParamsM2);
#elif ((defined STM32F30X)&&(defined THREE_SHUNT_INDEPENDENT_RESOURCES2))
  oCurrSensor[M2] = (CPWMC)R3_4_F3XX_NewObject(&PWMnCurrFdbkParamsM2, &R3_4_F30XParamsM2);
#elif ((defined STM32F30X)&&(defined THREE_SHUNT_SHARED_RESOURCES2))
  oCurrSensor[M2] = (CPWMC)R3_2_F3XX_NewObject(&PWMnCurrFdbkParamsM2, &R3_2_F30XParamsM2);
#elif ((defined STM32F30X)&&(defined SINGLE_SHUNT2))
  oCurrSensor[M2] = (CPWMC)R1F3XX_NewObject(&PWMnCurrFdbkParamsM2,&R1_F30XParamsM2);
#elif ((defined STM32F30X)&&(defined ICS_SENSORS2))
  oCurrSensor[M2] = (CPWMC)IF3XX_NewObject(&PWMnCurrFdbkParamsM2, &ICS_DDParamsM2);
#else
#error "Invalid boot: configuration not valid or to be assigned"
#endif
  
  PWMC_Init(oCurrSensor[M2]);
  
#if ((HW_OV_CURRENT_PROT_BYPASS2 == ENABLE) && (ON_OVER_VOLTAGE2 == TURN_ON_LOW_SIDES))
  oOCPDisabling[M2] = DOUT_NewObject(&DOUT_OCPDisablingParamsM2); 
  DOUT_Init(oOCPDisabling[M2]);
#endif 
  
#endif
  
  /* PWMC derived class start timers */
#if ((defined STM32HD) && (defined THREE_SHUNT))
  R3HD2_StartTimers();
#elif ((defined STM32HD) && (defined SINGLE_SHUNT))
  R1HD2_StartTimers();
#elif ((defined STM32HD) && (defined ICS_SENSORS))
  IHD2_StartTimers();
#elif ((defined STM32F2XX) && (defined THREE_SHUNT))
  R3F2XX_StartTimers();
#elif ((defined STM32F2XX) && (defined SINGLE_SHUNT))
  R1F2XX_StartTimers();
#elif ((defined STM32F2XX) && (defined ICS_SENSORS))
  IF2XX_StartTimers();
#elif ((defined STM32F40XX) && (defined THREE_SHUNT))
  R3F4XX_StartTimers();
#elif ((defined STM32F40XX) && (defined SINGLE_SHUNT))
  R1F4XX_StartTimers();
#elif ((defined STM32F40XX) && (defined ICS_SENSORS))
  IF4XX_StartTimers();
#elif ((defined STM32F30X) && (defined THREE_SHUNT_INDEPENDENT_RESOURCES))
  R3_4_F3XX_StartTimers();
#elif ((defined STM32F30X) && (defined THREE_SHUNT_SHARED_RESOURCES))
  R3_2_F3XX_StartTimers();
#elif ((defined STM32F30X) && (defined SINGLE_SHUNT))
  R1F3XX_StartTimers();
#elif ((defined STM32F30X) && (defined ICS_SENSORS))
  IF3XX_StartTimers();  
#endif
  
  oSTM[M1] = STM_NewObject();
  STM_Init(oSTM[M1]);
	
	oPIDPos[M1] = (CPID_PI)PID_NewObject(&PIPosParamsM1,&PIDPosParamsM1);
	PID_ObjectInit(oPIDPos[M1]);
	
	
	
  oPIDSpeed[M1] = (CPI)PI_NewObject(&PISpeedParamsM1);
  PI_ObjectInit(oPIDSpeed[M1]);  

#if (defined HFINJECTION)
  oSpeedSensor[M1] = (CSPD)HFI_FP_SPD_NewObject(&SpeednPosFdbkParamsM1,&HiFreqInjParamsM1); /* only if M1 has HFI */
#elif (defined STATE_OBSERVER_PLL)
  oSpeedSensor[M1] = (CSPD)STO_NewObject(&SpeednPosFdbkParamsM1,&STOParamsM1); /* speed sensor STO, ENC, HALL xNew and xParamsM1*/
#elif (defined STATE_OBSERVER_CORDIC)
  oSpeedSensor[M1] = (CSPD)STO_CR_NewObject(&SpeednPosFdbkParamsM1,&STO_CORDICParamsM1); /* speed sensor STO, ENC, HALL xNew and xParamsM1*/  
#elif (defined ENCODER)
  oSpeedSensor[M1] = (CSPD)ENC_NewObject(&SpeednPosFdbkParamsM1,&ENCParamsM1); /* speed sensor STO, ENC, HALL xNew and xParamsM1*/
#elif (defined HALL_SENSORS)
  #if (defined(STM32F30X))
    oSpeedSensor[M1] = (CSPD)HALL_F30X_NewObject(&SpeednPosFdbkParamsM1,&HALL_F30XParamsM1); /* speed sensor STO, ENC, HALL xNew and xParamsM1*/  
  #else /* Any other micros */
    oSpeedSensor[M1] = (CSPD)HALL_NewObject(&SpeednPosFdbkParamsM1,&HALLParamsM1); /* speed sensor STO, ENC, HALL xNew and xParamsM1*/  
  #endif
#endif  
  SPD_Init(oSpeedSensor[M1]);
  
#if AUX_SPEED_FDBK_M1 
#if (defined AUX_STATE_OBSERVER_PLL)
  oSpeedSensorAux_M1 = (CSPD)STO_NewObject(&SpeednPosFdbkParamsM1,&STOParamsM1); /* aux speed sensor STO, ENC, HALL xNew and xParamsM1*/
#elif (defined AUX_STATE_OBSERVER_CORDIC)
  oSpeedSensorAux_M1 = (CSPD)STO_CR_NewObject(&SpeednPosFdbkParamsM1,&STO_CORDICParamsM1); /* aux speed sensor STO, ENC, HALL xNew and xParamsM1*/  
#elif (defined VIEW_ENCODER_FEEDBACK)
  oSpeedSensorAux_M1 = (CSPD)ENC_NewObject(&SpeednPosFdbkParamsM1,&ENCParamsM1); /* aux speed sensor STO, ENC, HALL xNew and xParamsM1*/
#elif (defined VIEW_HALL_FEEDBACK)
  #if (defined(STM32F30X))
    oSpeedSensorAux_M1 = (CSPD)HALL_F30X_NewObject(&SpeednPosFdbkParamsM1,&HALL_F30XParamsM1); /* aux speed sensor STO, ENC, HALL xNew and xParamsM1*/  
  #else /* Any other micros */
    oSpeedSensorAux_M1 = (CSPD)HALL_NewObject(&SpeednPosFdbkParamsM1,&HALLParamsM1); /* aux speed sensor STO, ENC, HALL xNew and xParamsM1*/  
  #endif  
#endif  
  SPD_Init(oSpeedSensorAux_M1);
#endif
  
  oSTC[M1] = STC_NewObject(&SpeednTorqCtrlParamsM1);
  STC_Init(oSTC[M1],oPIDSpeed[M1],oSpeedSensor[M1]);

