tangb765/FredFoc/gimbal/stm32f40x/MCApplication/src/MCTasks.c
  oMCTList[M1] = oMCTuning[M1];
#endif

#ifdef DUALDRIVE
  oSTM[M2] = STM_NewObject();
  STM_Init(oSTM[M2]);
  
  oPIDSpeed[M2] = (CPI)PI_NewObject(&PISpeedParamsM2);
  PI_ObjectInit(oPIDSpeed[M2]); 

#if (defined HFINJECTION2)
  oSpeedSensor[M2] = (CSPD)HFI_FP_SPD_NewObject(&SpeednPosFdbkParamsM2,&HiFreqInjParamsM2); /* only if M2 has HFI */
#elif (defined STATE_OBSERVER_PLL2) 
  oSpeedSensor[M2] = (CSPD)STO_NewObject(&SpeednPosFdbkParamsM2,&STOParamsM2); /* speed sensor STO, ENC, HALL xNew and xParamsM2*/
#elif (defined STATE_OBSERVER_CORDIC2) 
  oSpeedSensor[M2] = (CSPD)STO_CR_NewObject(&SpeednPosFdbkParamsM2,&STO_CORDICParamsM2); /* speed sensor STO, ENC, HALL xNew and xParamsM2*/  
#elif (defined ENCODER2)
  oSpeedSensor[M2] = (CSPD)ENC_NewObject(&SpeednPosFdbkParamsM2,&ENCParamsM2); /* speed sensor STO, ENC, HALL xNew and xParamsM2*/
#elif (defined HALL_SENSORS2)
  #if (defined(STM32F30X))
    oSpeedSensor[M2] = (CSPD)HALL_F30X_NewObject(&SpeednPosFdbkParamsM2,&HALL_F30XParamsM2); /* speed sensor STO, ENC, HALL xNew and xParamsM2*/  
  #else /* Any other micros */
    oSpeedSensor[M2] = (CSPD)HALL_NewObject(&SpeednPosFdbkParamsM2,&HALLParamsM2); /* speed sensor STO, ENC, HALL xNew and xParamsM2*/  
  #endif  
#else
#error "Invalid boot: configuration not valid or to be assigned"
#endif
  
  SPD_Init(oSpeedSensor[M2]);
  
#if AUX_SPEED_FDBK_M2 
#if (defined AUX_STATE_OBSERVER_PLL2)
  oSpeedSensorAux_M2 = (CSPD)STO_NewObject(&SpeednPosFdbkParamsM2,&STOParamsM2); /* aux speed sensor STO, ENC, HALL xNew and xParamsM2*/
#elif (defined AUX_STATE_OBSERVER_CORDIC2)
  oSpeedSensorAux_M2 = (CSPD)STO_CR_NewObject(&SpeednPosFdbkParamsM2,&STO_CORDICParamsM2); /* aux speed sensor STO, ENC, HALL xNew and xParamsM2*/  
#elif (defined VIEW_ENCODER_FEEDBACK2)
  oSpeedSensorAux_M2 = (CSPD)ENC_NewObject(&SpeednPosFdbkParamsM2,&ENCParamsM2); /* aux speed sensor STO, ENC, HALL xNew and xParamsM2*/
#elif (defined VIEW_HALL_FEEDBACK2)
  #if (defined(STM32F30X))
    oSpeedSensorAux_M2 = (CSPD)HALL_F30X_NewObject(&SpeednPosFdbkParamsM2,&HALL_F30XParamsM2); /* aux speed sensor STO, ENC, HALL xNew and xParamsM2*/  
  #else /* Any other micros */
    oSpeedSensorAux_M2 = (CSPD)HALL_NewObject(&SpeednPosFdbkParamsM2,&HALLParamsM2); /* aux speed sensor STO, ENC, HALL xNew and xParamsM2*/
  #endif
#endif  
  SPD_Init(oSpeedSensorAux_M2);
#endif
  
  oSTC[M2] = STC_NewObject(&SpeednTorqCtrlParamsM2);
  STC_Init(oSTC[M2],oPIDSpeed[M2],oSpeedSensor[M2]);

#if ((defined NO_SPEED_SENSORS2)||(defined ENCODER2)||(defined VIEW_ENCODER_FEEDBACK2))
  oVSS_M2 = (CSPD)VSS_NewObject(&SpeednPosFdbkParamsM2,&VirtualSpeedSensorParamsM2);
  SPD_Init(oVSS_M2);                               
#endif
#if (defined NO_SPEED_SENSORS2)  
  oRUC_M2 = RUC_NewObject(&RevupCtrlParamsM2);        /* only if sensorless*/
  RUC_Init(oRUC_M2,oSTC[M2],(CVSS_SPD)oVSS_M2);        /* only if sensorless*/
#endif
#if ((defined ENCODER2)||(defined VIEW_ENCODER_FEEDBACK2))  
  oEAC_M2 = (CEAC)EAC_NewObject(&EncAlignCtrlParamsM2);
#endif
#if (defined ENCODER2)
  EAC_Init(oEAC_M2,oSTC[M2],(CVSS_SPD)oVSS_M2,(CENC_SPD)oSpeedSensor[M2]);
#endif
#if (defined VIEW_ENCODER_FEEDBACK2)
  EAC_Init(oEAC_M2,oSTC[M2],(CVSS_SPD)oVSS_M2,(CENC_SPD)oSpeedSensorAux_M2);
#endif  
  
  oPIDIq[M2] = (CPI)PI_NewObject(&PIIqParamsM2);
  PI_ObjectInit(oPIDIq[M2]);
  
  oPIDId[M2] = (CPI)PI_NewObject(&PIIdParamsM2);
  PI_ObjectInit(oPIDId[M2]);   

#if defined BUS_VOLTAGE_MEASUREMENT2
  oBusSensor[M2] = (CVBS)RVBS_NewObject(&RealBusVoltageSensorParamsM2,
                                       &RdividerParamsM2); /* powerboard configuration: Rdivider or Virtual*/  
#else
  oBusSensor[M2] = (CVBS)VVBS_NewObject(&VirtualBusVoltageSensorParamsM2,
                                       &VirtualBusParamsM2); /* powerboard configuration: Rdivider or Virtual*/    
#endif  
  VBS_Init(oBusSensor[M2],oCurrSensor[M1]);
  
  oMPM[M2] = (CMPM)PQD_NewObject(&PQD_MotorPowerMeasurementParamsM2);
  PQD_MPMInitStruct.pFOCVars = &FOCVars[M2];
  PQD_MPMInitStruct.oVBS = oBusSensor[M2];
  MPM_Init(oMPM[M2],(pMPMInitStruct_t)&PQD_MPMInitStruct);
  
#if ON_OVER_VOLTAGE2 == TURN_ON_R_BRAKE
  oR_Brake[M2] = DOUT_NewObject(&R_BrakeParamsM2); 
  DOUT_Init(oR_Brake[M2]);
#endif
  
#if defined HEAT_SINK_TEMPERATURE_MEASUREMENT2
  oTemperatureSensor[M2] = (CTSNS)NTC_NewObject(&RealTempSensorParamsM2,
                                               &NTCParamsM2); /* powerboard configuration: NTC or Virtual*/
#else
  oTemperatureSensor[M2] = (CTSNS)VTS_NewObject(&VirtualTempSensorParamsM2,
                                               &VirtualTParamsM2); /* powerboard configuration: NTC or Virtual*/
#endif
  
  TSNS_Init(oTemperatureSensor[M2],oCurrSensor[M1]);  
  
#if defined(FLUX_WEAKENING2)
  oPIFW[M2] = (CPI)PI_NewObject(&PIFluxWeakeningParamsM2);  /* only if M2 has FW */
  PI_ObjectInit(oPIFW[M2]);                                 /* PI_ObjectInit or PID_ObjectInit*/
  FWInitStructureM2.oFluxWeakeningPI = oPIFW[M2];           /* only if M2 has FW */
  FWInitStructureM2.oSpeedPI = oPIDSpeed[M2];                /* only if M2 has FW */
  FW_Init(oFW[M2],&FWInitStructureM2);                      /* only if M2 has FW */
#endif
  
#if defined(FEED_FORWARD_CURRENT_REGULATION2)
  FFInitStructureM2.oVBS = oBusSensor[M2]; /* only if M2 has FF */
  FFInitStructureM2.oPI_q = oPIDIq[M2];    /* only if M2 has FF */
  FFInitStructureM2.oPI_d = oPIDId[M2];    /* only if M2 has FF */
  FF_Init(oFF[M2],&FFInitStructureM2);    /* only if M2 has FF */
#endif
  
#if defined(OPEN_LOOP2)
  OL_Init(oOL[M2], oVSS_M2);     /* only if M2 has open loop */
#endif
  
#if defined(HFINJECTION2) 
  HFI_FP_InitStructureM2.oHFI_FP_SpeedSensor = (CHFI_FP_SPD)(oSpeedSensor[M2]); /* only if M2 has HFI */
  HFI_FP_InitStructureM2.pFOCVarsPtr = &FOCVars[M2];                            /* only if M2 has HFI */
  HFI_FP_InitStructureM2.oPI_q = oPIDIq[M2];                                    /* only if M2 has HFI */
  HFI_FP_InitStructureM2.oPI_d = oPIDId[M2];                                    /* only if M2 has HFI */
  HFI_FP_InitStructureM2.oVbusSensor = oBusSensor[M2];                          /* only if M1 has HFI */
  HFI_FP_Init(oHFI[M2], &HFI_FP_InitStructureM2);                               /* only if M2 has HFI */
#endif
  
  FOCVars[M2].bDriveInput = EXTERNAL;
  FOCVars[M2].Iqdref = STC_GetDefaultIqdref(oSTC[M2]);
  FOC_Clear(M2);
    
  oMCInterface[M2] = MCI_NewObject(MC_NULL);
  MCI_Init(oMCInterface[M2], oSTM[M2], oSTC[M2], &FOCVars[M2]);
  MCI_ExecSpeedRamp(oMCInterface[M2], 
  STC_GetMecSpeedRef01HzDefault(oSTC[M2]),0); /*First command to STC*/
  
  oMCIList[M2] = oMCInterface[M2]; 
    
#ifdef MC_TUNING_INTERFACE
  oMCTuning[M2] = MCT_NewObject(MC_NULL);
  
  MCTInitStruct.oPIDSpeed = oPIDSpeed[M2];
  MCTInitStruct.oPIDIq = oPIDIq[M2];
  MCTInitStruct.oPIDId = oPIDId[M2];
#if defined(FLUX_WEAKENING2)
  MCTInitStruct.oPIDFluxWeakening = oPIFW[M2]; /* only if M2 has FW */
#else
  MCTInitStruct.oPIDFluxWeakening = MC_NULL; /* if M2 doesn't has FW */
#endif
  MCTInitStruct.oPWMnCurrFdbk = oCurrSensor[M2];
#if (defined NO_SPEED_SENSORS2)  
  MCTInitStruct.oRevupCtrl = oRUC_M2;              /* only if M2 is sensorless*/
#else
  MCTInitStruct.oRevupCtrl = MC_NULL;              /* only if M2 is not sensorless*/
#endif
  MCTInitStruct.oSpeedSensorMain = oSpeedSensor[M2];
#if (AUX_SPEED_FDBK_M2)
  MCTInitStruct.oSpeedSensorAux = oSpeedSensorAux_M2; /* only if M2 has auxiliary sensor oSpeedSensorAux_M2*/
#else
  MCTInitStruct.oSpeedSensorAux = MC_NULL;            /* only if M2 has auxiliary sensor oSpeedSensorAux_M2*/
#endif

