tangb765/FredFoc/gimbal/stm32f40x/MCApplication/src/MCTasks.c
#if (defined NO_SPEED_SENSORS2)
  MCTInitStruct.oSpeedSensorVirtual = oVSS_M2;  /* only if M2 is sensorless*/
#endif
  MCTInitStruct.oSpeednTorqueCtrl = oSTC[M2];
  MCTInitStruct.oStateMachine = oSTM[M2];
  MCTInitStruct.oTemperatureSensor = oTemperatureSensor[M2];
  MCTInitStruct.oBusVoltageSensor = oBusSensor[M2];
  MCTInitStruct.oBrakeDigitalOutput = MC_NULL;   /* brake is defined, oBrakeM2*/
  MCTInitStruct.oNTCRelay = MC_NULL;             /* relay is defined, oRelayM2*/
  MCTInitStruct.oMPM = oMPM[M2];
#if defined(FLUX_WEAKENING2)
  MCTInitStruct.oFW = oFW[M2];
#else
  MCTInitStruct.oFW = MC_NULL;
#endif
#if defined(FEED_FORWARD_CURRENT_REGULATION2)
  MCTInitStruct.oFF = oFF[M2];
#else
  MCTInitStruct.oFF = MC_NULL;
#endif
#if defined(HFINJECTION2)
  MCTInitStruct.oHFI = oHFI[M2];
#else
  MCTInitStruct.oHFI = MC_NULL;
#endif
  
  MCT_Init(oMCTuning[M2],MCTInitStruct);
  
  oMCTList[M2] = oMCTuning[M2];
#endif
#endif  
  
#if (INRUSH_CURRLIMIT_ENABLING == ENABLE)
  oICLDOUT_M1 = DOUT_NewObject(&ICLDOUTParamsM1);
  DOUT_Init(oICLDOUT_M1);
  oICL_M1 = ICL_NewObject(&InrushCurrentLimiterParamsM1);
  ICL_Init(oICL_M1, oBusSensor[M1], oICLDOUT_M1);
  STM_NextState(oSTM[M1],ICLWAIT);
#endif 
#if (INRUSH_CURRLIMIT_ENABLING2 == ENABLE)
  oICLDOUT_M2 = DOUT_NewObject(&ICLDOUTParamsM2);
  DOUT_Init(oICLDOUT_M2);
  oICL_M2 = ICL_NewObject(&InrushCurrentLimiterParamsM2);
  ICL_Init(oICL_M2, oBusSensor[M2], oICLDOUT_M2);
  STM_NextState(oSTM[M2],ICLWAIT);
#endif
}


/**
  * @brief  It executes MC tasks: safety task and medium frequency for all
  *         drive instances. It have to be clocked with Systick frequnecy.
  * @param  None
  * @retval None
  */
void MC_Scheduler(void)
{
  if(hMFTaskCounterM1 > 0u)
  {
    hMFTaskCounterM1--;
  }   
  else
  {
   TSK_MediumFrequencyTaskM1();
/****************************** USE ONLY FOR SDK 4.0 EXAMPLES *************/  
#if defined(EXAMPLE_SPEEDMONITOR)
   ARR_TIM5_update(oSpeedSensor[M1]); 
#endif
/**************************************************************************/    
   hMFTaskCounterM1 = MF_TASK_OCCURENCE_TICKS;
  } 
    
#ifdef DUALDRIVE
  if(hMFTaskCounterM2 > 0u)
  {
    hMFTaskCounterM2--;
  }   
  else
  {
    TSK_MediumFrequencyTaskM2();
    hMFTaskCounterM2 = MF_TASK_OCCURENCE_TICKS2;
  }
#endif
  
  if(hBootCapDelayCounterM1 > 0u)
  {
    hBootCapDelayCounterM1--;    
  } 
  if(hStopPermanencyCounterM1 > 0u)
  {
    hStopPermanencyCounterM1--;    
  }
#ifdef DUALDRIVE
  if(hBootCapDelayCounterM2 > 0u)
  {
    hBootCapDelayCounterM2--;    
  }
  if(hStopPermanencyCounterM2 > 0u)
  {
    hStopPermanencyCounterM2--;    
  }
#endif
}

volatile uint8_t MotorMode = 251;
/**
  * @brief  It executes some of the control duties on Motor 1 accordingly with  
  *         the present state of its state machine. In particular, duties 
  *         requiring a specific timing (e.g. speed controller) are here 
  *         executed
  * @param  None
  * @retval void
  */
void TSK_MediumFrequencyTaskM1(void)
{
  State_t StateM1;
  bool IsSpeedReliable;
  int16_t wAux = 0;
  
#if (INRUSH_CURRLIMIT_ENABLING == ENABLE)
  ICLState_t ICLState = ICL_Exec(oICL_M1);
#endif
  
#if (defined(VIEW_HALL_FEEDBACK)||defined(VIEW_ENCODER_FEEDBACK)||defined(AUX_STATE_OBSERVER_PLL)||defined(AUX_STATE_OBSERVER_CORDIC))
  bool IsSpeedReliableAux = SPD_CalcAvrgMecSpeed01Hz(oSpeedSensorAux_M1,&wAux);  /*  Only if Aux sensored is enabled */
#endif  
  
  IsSpeedReliable = SPD_CalcAvrgMecSpeed01Hz(oSpeedSensor[M1],&wAux);
  
  MPM_CalcElMotorPower(oMPM[M1]);
  
  StateM1 = STM_GetState(oSTM[M1]);
  switch(StateM1)
  {
#if (INRUSH_CURRLIMIT_ENABLING == ENABLE)
  case ICLWAIT:
    if (ICLState == ICL_INACTIVE)
    {
      /* If ICL Inactive move to IDLE */
      STM_NextState(oSTM[M1],IDLE);
    }
    break;
#endif
    
#if ((defined ENCODER)||(defined VIEW_ENCODER_FEEDBACK)) /*  only for encoder*/
  case IDLE:
    if (EAC_GetRestartState(oEAC_M1))
    {
      EAC_SetRestartState(oEAC_M1,FALSE); /* Reset restart flag*/
      STM_NextState(oSTM[M1],IDLE_START);
    }
		else
		{
			
		}
    break;
#endif
    
  case IDLE_START:
#if ((defined ENCODER)||(defined VIEW_ENCODER_FEEDBACK)) /*  only for encoder*/
    if (EAC_IsAligned(oEAC_M1) == FALSE)
    {
      EAC_SetRestartState(oEAC_M1,TRUE); /* Set restart flag. Run after align*/
      STM_NextState(oSTM[M1],IDLE_ALIGNMENT);
      break;
    }
#endif
#if (CHARGE_BOOT_CAP_ENABLING == ENABLE)
    PWMC_TurnOnLowSides(oCurrSensor[M1]); 
    TSK_SetChargeBootCapDelayM1(CHARGE_BOOT_CAP_TICKS);
    STM_NextState(oSTM[M1],CHARGE_BOOT_CAP);
#else
    PWMC_CurrentReadingCalibr(oCurrSensor[M1],CRC_START);
    STM_NextState(oSTM[M1],OFFSET_CALIB);
#endif
    break;
  
#if (CHARGE_BOOT_CAP_ENABLING == ENABLE)
  case CHARGE_BOOT_CAP:
    if (TSK_ChargeBootCapDelayHasElapsedM1())
    {
      PWMC_CurrentReadingCalibr(oCurrSensor[M1],CRC_START);
      STM_NextState(oSTM[M1],OFFSET_CALIB);
    }
    break;
#endif
    
  case OFFSET_CALIB:
    if (PWMC_CurrentReadingCalibr(oCurrSensor[M1],CRC_EXEC))
    {
      STM_NextState(oSTM[M1],CLEAR);
    }
    break;
    
  case CLEAR:
#if (defined NO_SPEED_SENSORS)      
    FOCVars[M1].bDriveInput = EXTERNAL;                               /* only for sensorless */
    STC_SetSpeedSensor(oSTC[M1],oVSS_M1);                             /* only for sensorless */
    RUC_Clear(oRUC_M1,MCI_GetImposedMotorDirection(oMCInterface[M1])); /* only for sensorless */
#endif
    
#if (defined HFINJECTION)
    STC_SetSpeedSensor(oSTC[M1],oSpeedSensor[M1]);
#endif

    SPD_Clear(oSpeedSensor[M1]); 		/*  only for sensorless/hall/encoder main*/
#if (defined(AUX_STATE_OBSERVER_PLL) || defined(AUX_STATE_OBSERVER_CORDIC) || defined(VIEW_HALL_FEEDBACK) || defined(VIEW_ENCODER_FEEDBACK))
    SPD_Clear(oSpeedSensorAux_M1); 		/*  only for sensorless/hall main/auxiliary*/
#endif
    if(STM_NextState(oSTM[M1], IDLE) == TRUE)
    {
      FOC_Clear(M1);
      PWMC_SwitchOnPWM(oCurrSensor[M1]); 
    }
    break;
    
#if ((defined ENCODER)||(defined VIEW_ENCODER_FEEDBACK)) /*  only for encoder*/
    case IDLE_ALIGNMENT:
#if (CHARGE_BOOT_CAP_ENABLING == ENABLE)
    PWMC_TurnOnLowSides(oCurrSensor[M1]); 
    TSK_SetChargeBootCapDelayM1(CHARGE_BOOT_CAP_TICKS);
    STM_NextState(oSTM[M1],ALIGN_CHARGE_BOOT_CAP);
#else
    PWMC_CurrentReadingCalibr(oCurrSensor[M1],CRC_START);
    STM_NextState(oSTM[M1],ALIGN_OFFSET_CALIB);
#endif
    break;
  
#if (CHARGE_BOOT_CAP_ENABLING == ENABLE)
  case ALIGN_CHARGE_BOOT_CAP:
    if (TSK_ChargeBootCapDelayHasElapsedM1())
    {
      PWMC_CurrentReadingCalibr(oCurrSensor[M1],CRC_START);
      STM_NextState(oSTM[M1],ALIGN_OFFSET_CALIB);
    }
    break;
#endif
    
  case ALIGN_OFFSET_CALIB:
    if (PWMC_CurrentReadingCalibr(oCurrSensor[M1],CRC_EXEC))
    {
      STM_NextState(oSTM[M1],ALIGN_CLEAR);
    }
    break;
    
  case ALIGN_CLEAR:
    FOCVars[M1].bDriveInput = EXTERNAL;
    STC_SetSpeedSensor(oSTC[M1],oVSS_M1);
    EAC_StartAlignment(oEAC_M1);
    
    if(STM_NextState(oSTM[M1], ALIGNMENT) == TRUE)
    {
      FOC_Clear(M1);
      PWMC_SwitchOnPWM(oCurrSensor[M1]); 
    }
    break;
#endif
    
  case START:
    {    
#if (defined NO_SPEED_SENSORS)  /* only for sensor-less control */  
      
      int16_t hForcedMecSpeed01Hz;
      Curr_Components IqdRef;
      bool StartUpTransitionEnded;
      bool StartUpDoTransition;
      
      if(!RUC_Exec(oRUC_M1))
      {
        #if (OPEN_LOOP_FOC == ENABLE)
          /* No error generated when OPEN LOOP is enabled. */
        #else
          STM_FaultProcessing(oSTM[M1], MC_START_UP, 0);  /*Time allowed for startup has ended*/
        #endif
      }
      
