tangb765/FredFoc/gimbal/stm32f40x/MCApplication/src/MCTasks.c
#if defined(HFINJECTION) || (defined(DUALDRIVE) && defined(HFINJECTION2))
  if (oHFI[bMotor])
  {
    HFI_FP_Clear(oHFI[bMotor]);
  }
#endif
}

/**
  * @brief  Use this method to initialize additional methods (if any) in 
  *         START_TO_RUN state
  * @param  bMotor related motor it can be M1 or M2 
  * @retval none
  */
void FOC_InitAdditionalMethods(uint8_t bMotor)
{
#if defined(FEED_FORWARD_CURRENT_REGULATION) || (defined(DUALDRIVE) && defined(FEED_FORWARD_CURRENT_REGULATION2))
  if (oFF[M1])
  {
    FF_InitFOCAdditionalMethods(oFF[M1]);
  }
#endif
}

/**
  * @brief  It computes the new values of Iqdref (current references on qd 
  *         reference frame) based on the required electrical torque information
  *         provided by oTSC object (internally clocked). 
  *         If implemented in the derived class it executes flux weakening and/or
  *         MTPA algorithm(s). It must be called with the periodicity specified  
  *         in oTSC parameters
  * @param  bMotor related motor it can be M1 or M2 
  * @retval none
  */
void FOC_CalcCurrRef(uint8_t bMotor)
{
  if(FOCVars[bMotor].bDriveInput == INTERNAL)
  {
    FOCVars[bMotor].hTeref = STC_CalcTorqueReference(oSTC[bMotor]);
    
    FOCVars[bMotor].Iqdref.qI_Component1 = FOCVars[bMotor].hTeref;
    
#if defined(IPMSM_MTPA) || (defined(DUALDRIVE) && defined(IPMSM_MTPA2))
    if (oMTPA[bMotor])
    {
      FOCVars[bMotor].Iqdref = MTPA_CalcCurrRef(oMTPA[bMotor], FOCVars[bMotor].Iqdref);
    }
#endif
    
#if defined(FLUX_WEAKENING) || (defined(DUALDRIVE) && defined(FLUX_WEAKENING2))
    if (oFW[bMotor])
    {
      FOCVars[bMotor].Iqdref = FW_CalcCurrRef(oFW[bMotor],FOCVars[bMotor].Iqdref);
    }
#endif
    
#if defined(FEED_FORWARD_CURRENT_REGULATION) || (defined(DUALDRIVE) && defined(FEED_FORWARD_CURRENT_REGULATION2))
    if (oFF[bMotor])
    {
      FF_VqdffComputation(oFF[bMotor], oSpeedSensor[bMotor], FOCVars[bMotor].Iqdref);
    }
#endif
  }
}

/**
  * @brief  It set a counter intended to be used for counting the delay required 
  *         for drivers boot capacitors charging of motor 1
  * @param  hTickCount number of ticks to be counted
  * @retval void
  */
void TSK_SetChargeBootCapDelayM1(uint16_t hTickCount)
{
   hBootCapDelayCounterM1 = hTickCount; 
}

/**
  * @brief  Use this function to know whether the time required to charge boot 
  *         capacitors of motor 1 has elapsed
  * @param  none
  * @retval bool TRUE if time has elapsed, FALSE otherwise
  */
bool TSK_ChargeBootCapDelayHasElapsedM1(void)
{
  bool retVal = FALSE;
  if (hBootCapDelayCounterM1 == 0)
  {
    retVal = TRUE;
  }
  return (retVal);
}

/**
  * @brief  It set a counter intended to be used for counting the permanency 
  *         time in STOP state of motor 1
  * @param  hTickCount number of ticks to be counted
  * @retval void
  */
void TSK_SetStopPermanencyTimeM1(uint16_t hTickCount)
{
  hStopPermanencyCounterM1 = hTickCount;  
}

/**
  * @brief  Use this function to know whether the permanency time in STOP state 
  *         of motor 1 has elapsed
  * @param  none
  * @retval bool TRUE if time is elapsed, FALSE otherwise
  */
bool TSK_StopPermanencyTimeHasElapsedM1(void)
{
  bool retVal = FALSE;
  if (hStopPermanencyCounterM1 == 0)
  {
    retVal = TRUE;
  }
  return (retVal);
}

#ifdef DUALDRIVE
/**
  * @brief  It executes some of the control duties on Motor 2 accordingly with  
  *         the present state of its state machine. In particular, duties 
  *         requiring a specific timing (e.g. speed controller(s)) are here 
  *         executed
  * @param  None
  * @retval void
  */
void TSK_MediumFrequencyTaskM2(void)
{
  State_t StateM2;
  bool IsSpeedReliable;
  int16_t wAux = 0;
  
#if (INRUSH_CURRLIMIT_ENABLING2 == ENABLE)
  ICLState_t ICLState = ICL_Exec(oICL_M2);
#endif
  
#if (defined(VIEW_HALL_FEEDBACK2)||defined(VIEW_ENCODER_FEEDBACK2)||defined(AUX_STATE_OBSERVER_PLL2)||defined(AUX_STATE_OBSERVER_CORDIC2))
  bool IsSpeedReliableAux = SPD_CalcAvrgMecSpeed01Hz(oSpeedSensorAux_M2,&wAux);  /*  Only if Aux sensored is enabled */
#endif  
  
  IsSpeedReliable = SPD_CalcAvrgMecSpeed01Hz(oSpeedSensor[M2],&wAux);  
  
  MPM_CalcElMotorPower(oMPM[M2]);
  
  StateM2 = STM_GetState(oSTM[M2]);
  switch(StateM2)
  {
#if (INRUSH_CURRLIMIT_ENABLING2 == ENABLE)
  case ICLWAIT:
    if (ICLState == ICL_INACTIVE)
    {
      /* If ICL Inactive move to IDLE */
      STM_NextState(oSTM[M2],IDLE);
    }
    break;
#endif

		
#if ((defined ENCODER)||(defined VIEW_ENCODER_FEEDBACK)) /*  only for encoder*/
  case IDLE:
    if (EAC_GetRestartState(oEAC_M2))
    {
      EAC_SetRestartState(oEAC_M2,FALSE); /* Reset restart flag*/
      STM_NextState(oSTM[M2],IDLE_START);
    }
		else
		{
	
		}
    break;
#endif
    
  case IDLE_START:
#if (CHARGE_BOOT_CAP_ENABLING2 == ENABLE)
    PWMC_TurnOnLowSides(oCurrSensor[M2]); 
    TSK_SetChargeBootCapDelayM2(CHARGE_BOOT_CAP_TICKS2);
    STM_NextState(oSTM[M2],CHARGE_BOOT_CAP);
#else
    PWMC_CurrentReadingCalibr(oCurrSensor[M2],CRC_START);
    STM_NextState(oSTM[M2],OFFSET_CALIB);
#endif
    break;
    
#if (CHARGE_BOOT_CAP_ENABLING2 == ENABLE)
  case CHARGE_BOOT_CAP:
    if (TSK_ChargeBootCapDelayHasElapsedM2())
    {
      PWMC_CurrentReadingCalibr(oCurrSensor[M2],CRC_START);
      STM_NextState(oSTM[M2],OFFSET_CALIB);
    }
    break;
#endif
    
  case OFFSET_CALIB:
    if (PWMC_CurrentReadingCalibr(oCurrSensor[M2],CRC_EXEC))
    {
      STM_NextState(oSTM[M2],CLEAR);
    }
    break;
    
  case CLEAR:
#if (defined NO_SPEED_SENSORS2)      
    FOCVars[M2].bDriveInput = EXTERNAL;                               /*  only for sensorless*/
    STC_SetSpeedSensor(oSTC[M2],oVSS_M2);                             /*  only for sensorless */        
    RUC_Clear(oRUC_M2,MCI_GetImposedMotorDirection(oMCInterface[M2])); /*  only for sensorless */
#endif
    
#if (defined HFINJECTION2)
    STC_SetSpeedSensor(oSTC[M2],oSpeedSensor[M2]);
#endif
    
    SPD_Clear(oSpeedSensor[M2]); 		/*  only for sensorless/hall/encoder main*/
#if (defined(AUX_STATE_OBSERVER_PLL2) || defined(AUX_STATE_OBSERVER_CORDIC2) || defined(VIEW_HALL_FEEDBACK2) || defined(VIEW_ENCODER_FEEDBACK2))
    SPD_Clear(oSpeedSensorAux_M2); 		/*  only for sensorless/hall main/auxiliary*/
#endif
    if(STM_NextState(oSTM[M2], START) == TRUE)
    {
      FOC_Clear(M2);
      PWMC_SwitchOnPWM(oCurrSensor[M2]); 
    }
    break;
#if ((defined ENCODER2)||(defined VIEW_ENCODER_FEEDBACK2)) /*  only for encoder*/
  case IDLE_ALIGNMENT:
#if (CHARGE_BOOT_CAP_ENABLING2 == ENABLE)
    PWMC_TurnOnLowSides(oCurrSensor[M2]); 
    TSK_SetChargeBootCapDelayM2(CHARGE_BOOT_CAP_TICKS);
    STM_NextState(oSTM[M2],ALIGN_CHARGE_BOOT_CAP);
#else
    PWMC_CurrentReadingCalibr(oCurrSensor[M2],CRC_START);
    STM_NextState(oSTM[M2],ALIGN_OFFSET_CALIB);
#endif
    break;
    
#if (CHARGE_BOOT_CAP_ENABLING2 == ENABLE)
  case ALIGN_CHARGE_BOOT_CAP:
    if (TSK_ChargeBootCapDelayHasElapsedM2())
    {
      PWMC_CurrentReadingCalibr(oCurrSensor[M2],CRC_START);
      STM_NextState(oSTM[M2],ALIGN_OFFSET_CALIB);
    }
    break;
#endif
    
  case ALIGN_OFFSET_CALIB:
    if (PWMC_CurrentReadingCalibr(oCurrSensor[M2],CRC_EXEC))
    {
      STM_NextState(oSTM[M2],ALIGN_CLEAR);
    }
    break;
    
  case ALIGN_CLEAR:
    FOCVars[M2].bDriveInput = EXTERNAL;
    STC_SetSpeedSensor(oSTC[M2],oVSS_M2);;
    EAC_StartAlignment(oEAC_M2);
    
    if(STM_NextState(oSTM[M2], ALIGNMENT) == TRUE)
    {
      FOC_Clear(M2);
      PWMC_SwitchOnPWM(oCurrSensor[M2]); 
    }
    break;
#endif
    
  case START:
    /* only for sensor-less control */
#if (defined NO_SPEED_SENSORS2)    
    {     
      int16_t hForcedMecSpeed01Hz;
      Curr_Components IqdRef;
      bool StartUpTransitionEnded;
      bool StartUpDoTransition;
      
