tangb765/FredFoc/gimbal/stm32f40x/MCApplication/src/MCTasks.c
      STO_Inputs.Vbus = VBS_GetAvBusVoltage_d(oBusSensor[bMotorNbr]); /*  only for sensorless*/
#endif
#if ((defined STATE_OBSERVER_CORDIC)||(defined AUX_STATE_OBSERVER_CORDIC))
      STO_CR_Inputs.Ialfa_beta = FOCVars[bMotorNbr].Ialphabeta;  /* only if motor0 is sensorless*/  
      
      STO_CR_Inputs.Vbus = VBS_GetAvBusVoltage_d(oBusSensor[bMotorNbr]); /*  only for sensorless*/
#endif      
#if (defined STATE_OBSERVER_PLL)
      
      IsAccelerationStageReached = RUC_FirstAccelerationStageReached(oRUC_M1);
      
      SPD_CalcAngle(oSpeedSensor[bMotorNbr],&STO_Inputs, 0, bMotorNbr);   /* if not sensorless then 2nd parameter is MC_NULL*/
      
      STO_CalcAvrgElSpeedDpp((CSTO_SPD) oSpeedSensor[bMotorNbr]); /*  Only in case of Sensor-less */
      
      if (IsAccelerationStageReached == FALSE)
      {
        STO_ResetPLL((CSTO_SPD)oSpeedSensor[bMotorNbr]);
      }    
      
      hState = STM_GetState(oSTM[bMotorNbr]);
      if((hState == START) || (hState == START_RUN)) /*  only for sensor-less*/
      {
        int16_t hObsAngle;
        hObsAngle = SPD_GetElAngle(oSpeedSensor[bMotorNbr]);        
        SPD_CalcAngle(oVSS_M1,&hObsAngle, 0, bMotorNbr);  
      }
#endif
#if (defined STATE_OBSERVER_CORDIC)
      SPD_CalcAngle(oSpeedSensor[bMotorNbr],&STO_CR_Inputs, 0, bMotorNbr);   /* if not sensorless then 2nd parameter is MC_NULL*/
      
      STO_CR_CalcAvrgElSpeedDpp((CSTO_CR_SPD) oSpeedSensor[bMotorNbr]); /*  Only in case of Sensor-less */
      
      hState = STM_GetState(oSTM[bMotorNbr]);
      if((hState == START) || (hState == START_RUN)) /*  only for sensor-less*/
      {
        int16_t hObsAngle;
        hObsAngle = SPD_GetElAngle(oSpeedSensor[bMotorNbr]);        
        SPD_CalcAngle(oVSS_M1,&hObsAngle, 0, bMotorNbr);  
      }
#endif      
#if (defined(AUX_STATE_OBSERVER_PLL))
      SPD_CalcAngle(oSpeedSensorAux_M1,&STO_Inputs, 0, bMotorNbr);   /* if not sensorless then 2nd parameter is MC_NULL*/
      
      STO_CalcAvrgElSpeedDpp((CSTO_SPD) oSpeedSensorAux_M1); /*  Only in case of Sensor-less */
#endif
#if (defined(AUX_STATE_OBSERVER_CORDIC))
      SPD_CalcAngle(oSpeedSensorAux_M1,&STO_CR_Inputs, 0, bMotorNbr);   /* if not sensorless then 2nd parameter is MC_NULL*/
      
      STO_CR_CalcAvrgElSpeedDpp((CSTO_CR_SPD) oSpeedSensorAux_M1); /*  Only in case of Sensor-less */
#endif       
    }
    else
    {
#if ((defined STATE_OBSERVER_PLL2)||(defined AUX_STATE_OBSERVER_PLL2))
      STO_Inputs.Ialfa_beta = FOCVars[bMotorNbr].Ialphabeta;  /* only if motor1 is sensorless*/  
      
      STO_Inputs.Vbus = VBS_GetAvBusVoltage_d(oBusSensor[bMotorNbr]); /*  only for sensorless*/
#endif
#if ((defined STATE_OBSERVER_CORDIC2)||(defined AUX_STATE_OBSERVER_CORDIC2))
      STO_CR_Inputs.Ialfa_beta = FOCVars[bMotorNbr].Ialphabeta;  /* only if motor1 is sensorless*/  
      
      STO_CR_Inputs.Vbus = VBS_GetAvBusVoltage_d(oBusSensor[bMotorNbr]); /*  only for sensorless*/
#endif      
#if (defined STATE_OBSERVER_PLL2)
      
      IsAccelerationStageReached = RUC_FirstAccelerationStageReached(oRUC_M2);
      
      SPD_CalcAngle(oSpeedSensor[bMotorNbr],&STO_Inputs, 0, bMotorNbr);   /* if not sensorless then 2nd parameter is MC_NULL*/
      
      STO_CalcAvrgElSpeedDpp((CSTO_SPD) oSpeedSensor[bMotorNbr]); /*  Only in case of Sensor-less */
      
      if (IsAccelerationStageReached == FALSE)
      {
        STO_ResetPLL((CSTO_SPD)oSpeedSensor[bMotorNbr]);
      }       
      
      hState = STM_GetState(oSTM[bMotorNbr]);
      if((hState == START) || (hState == START_RUN)) /*  only for sensor-less*/
      {
        int16_t hObsAngle;
        hObsAngle = SPD_GetElAngle(oSpeedSensor[bMotorNbr]);
        SPD_CalcAngle(oVSS_M2,&hObsAngle, 0, bMotorNbr);
      }      
#endif
#if (defined STATE_OBSERVER_CORDIC2)
      SPD_CalcAngle(oSpeedSensor[bMotorNbr],&STO_CR_Inputs, 0, bMotorNbr);   /* if not sensorless then 2nd parameter is MC_NULL*/
      
      STO_CR_CalcAvrgElSpeedDpp((CSTO_CR_SPD) oSpeedSensor[bMotorNbr]); /*  Only in case of Sensor-less */
      
      hState = STM_GetState(oSTM[bMotorNbr]);
      if((hState == START) || (hState == START_RUN)) /*  only for sensor-less*/
      {
        int16_t hObsAngle;
        hObsAngle = SPD_GetElAngle(oSpeedSensor[bMotorNbr]);        
        SPD_CalcAngle(oVSS_M2,&hObsAngle, 0, bMotorNbr);
      }      
#endif      
#if (defined(AUX_STATE_OBSERVER_PLL2))
      SPD_CalcAngle(oSpeedSensorAux_M2,&STO_Inputs, 0, bMotorNbr);   /* if not sensorless then 2nd parameter is MC_NULL*/
      
      STO_CalcAvrgElSpeedDpp((CSTO_SPD) oSpeedSensorAux_M2); /*  Only in case of Sensor-less */
#endif
#if (defined(AUX_STATE_OBSERVER_CORDIC2))
      SPD_CalcAngle(oSpeedSensorAux_M2,&STO_CR_Inputs, 0, bMotorNbr);   /* if not sensorless then 2nd parameter is MC_NULL*/
      
      STO_CR_CalcAvrgElSpeedDpp((CSTO_CR_SPD) oSpeedSensorAux_M2); /*  Only in case of Sensor-less */
#endif      
    }    
  }
  
  FOC_array_head++;
  if (FOC_array_head == FOC_ARRAY_LENGHT)
  {
    FOC_array_head = 0;
  }
  
#endif
	

  if(hMFTaskCounterM1_t > 0u)
  {
    hMFTaskCounterM1_t--;
  }   
  else
  {
	 rt_sem_release(&hMFTask1_sem);
   hMFTaskCounterM1_t = TF_REGULATION_RATE/SPEED_LOOP_FREQUENCY_HZ-1;
  } 
    
#ifdef DUALDRIVE
  if(hMFTaskCounterM2_t > 0u)
  {
    hMFTaskCounterM2_t--;
  }   
  else
  {
		rt_sem_release(&hMFTask2_sem);
    hMFTaskCounterM2_t = TF_REGULATION_RATE2/SPEED_LOOP_FREQUENCY_HZ2-1;
  }
#endif
	
	
  return bMotorNbr;
}

#if defined (CCMRAM)
#if defined (__ICCARM__)
#pragma location = ".ccmram"
#elif defined (__CC_ARM)
__attribute__((section ("ccmram")))
#endif
#endif
/**
  * @brief It executes the core of FOC drive that is the controllers for Iqd 
  *        currents regulation. Reference frame transformations are carried out 
  *        accordingly to the active speed sensor. It must be called periodically
  *        when new motor currents have been converted
  * @param this related object of class CFOC.
  * @retval int16_t It returns MC_NO_FAULTS if the FOC has been ended before 
  *         next PWM Update event, MC_FOC_DURATION otherwise
  */
#pragma inline
extern rt_uint8_t motor_iqcurrent_test;
extern rt_uint8_t motor_idcurrent_test;
Curr_Components Iab, Ialphabeta, Iqd;
uint16_t FOC_CurrController(uint8_t bMotor)
{
  
